util/src/main/resources/testData/incomingMsg.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header xmlns:addressing="http://www.w3.org/2005/08/addressing" xmlns:spirit="spirit:soap:transaction:1.0">
    <addressing:To env:mustUnderstand="1">http://tianiapp04t:8081/SpiritProxy/RspGW/VLERCOM201_19_DocRetrieve_Proxy</addressing:To>
    <addressing:Action env:mustUnderstand="1">urn:ihe:iti:2007:CrossGatewayRetrieve</addressing:Action>
    <addressing:MessageID>uuid:C3F5A03D-1A0C-4F62-ADC7-F3C007CD50CF</addressing:MessageID>
    <addressing:ReplyTo>
      <addressing:Address>http://www.w3.org/2005/08/addressing/anonymous</addressing:Address>
    </addressing:ReplyTo>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <saml2:Assertion ID="_70e21708-5d2a-4c68-91a1-da667980f338" IssueInstant="2014-11-10T21:18:13.506Z" Version="2.0" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema">
        <saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">urn:tiani-spirit:sts</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_70e21708-5d2a-4c68-91a1-da667980f338">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces PrefixList="xs" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>4HlJr9mA72OMob2KH6iN6gDhGAw=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>
1hgPAOfbgj1bXEUAL9COrbDLRW5VjdsRcpr3KAKWur9k/cxZNYid+jyOh9Cag3jhfkqPP9eeUZhZ
EwGd1LHnzKWB5hDJ5+2HT3kCL16gv3H02hbzRXqqhts8uTSvDXV8qrV6RmK+Vez5h2/+oliG4m3V
Mn89Y5ZpMeawJZDTjKz3t+y4lQ7JRkdaDtpFklCGAy+tB6/zA9yxJzwcRNNF8SXspPTtYbYjLUAQ
pOM+vRJZeOP3ML6oCjxNKh2dgyUpZV5bnNcGKAQA2GYi8qXlhkoqCmYrIonf4Bz6Yr5pSxtAhXoO
5gPaVdndTUTbTz1VLZd2RuSQJCSealx95fzfrA==
</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>MIIHLDCCBhSgAwIBAgIES3RYczANBgkqhkiG9w0BAQsFADB2MQswCQYDVQQGEwJVUzEQMA4GA1UE
ChMHRW50cnVzdDEiMCAGA1UECxMZQ2VydGlmaWNhdGlvbiBBdXRob3JpdGllczExMC8GA1UECxMo
RW50cnVzdCBORkkgVGVzdCBTaGFyZWQgU2VydmljZSBQcm92aWRlcjAeFw0xNDA5MjkyMDAzNTBa
Fw0xNTAzMjkyMDMzNTBaMFQxCzAJBgNVBAYTAlVTMQ0wCwYDVQQKEwRuaGluMRIwEAYDVQQLEwlO
SElOLVRlc3QxIjAgBgNVBAMTGXRlc3RoaWVpbml0aWF0b3IuaW5ocy5vcmcwggEiMA0GCSqGSIb3
DQEBAQUAA4IBDwAwggEKAoIBAQDjNBX/X/e+0zZ1JkC7ZGN/21m83lNSQvT/mbiAo/1NVTbe8ADO
YP/94RwoB2UNqw7Ax7w+HBwvsCHh5gNiqm/DKSn+nkGA2y/XriglZa5lFe9bvcNxNxnj+8SVVHyn
APVAT/3/8pJC6brfjTepjcf4jGjC9aoFXTIz5OzXlevmf/gFW5enc2ubGJA4FesYPO9hlcwq+6RH
gcqCF63hbSPmDF+P8nVZcQeUK2msLqeMIcCgpOMhhbAYZM1utBDgH/4YiRtLnJbxbjwExxoWQw3j
oHFuaUzrLVmZr41r9VsaHLFk0XeGoNsRJqUmx6OHwIi+dxiwDv35Ng/V1/XB7Pw9AgMBAAGjggPi
MIID3jALBgNVHQ8EBAMCBaAwEQYJYIZIAYb4QgEBBAQDAgbAMIIBfQYIKwYBBQUHAQEEggFvMIIB
azBVBggrBgEFBQcwAoZJaHR0cDovL25maXRlc3R3ZWIubWFuYWdlZC5lbnRydXN0LmNvbS9BSUEv
Q2VydHNJc3N1ZWRUb05GSU1lZGl1bVNTUENBLnA3YzCBxwYIKwYBBQUHMAKGgbpsZGFwOi8vbmZp
dGVzdGRpci5tYW5hZ2VkLmVudHJ1c3QuY29tL291PUVudHJ1c3QlMjBORkklMjBUZXN0JTIwU2hh
cmVkJTIwU2VydmljZSUyMFByb3ZpZGVyLG91PUNlcnRpZmljYXRpb24lMjBBdXRob3JpdGllcyxv
PUVudHJ1c3QsYz1VUz9jQUNlcnRpZmljYXRlO2JpbmFyeSxjcm9zc0NlcnRpZmljYXRlUGFpcjti
aW5hcnkwSAYIKwYBBQUHMAGGPGh0dHA6Ly9uZml0ZXN0b2NzcC5tYW5hZ2VkLmVudHJ1c3QuY29t
L09DU1AvTkZJVGVzdFJlc3BvbmRlcjCCAaYGA1UdHwSCAZ0wggGZMIIBAaCB/qCB+4Y8aHR0cDov
L25maXRlc3R3ZWIubWFuYWdlZC5lbnRydXN0LmNvbS9DUkxzL05GSVRlc3RTU1BDQTEuY3JshoG6
bGRhcDovL25maXRlc3RkaXIubWFuYWdlZC5lbnRydXN0LmNvbS9jbj1XaW5Db21iaW5lZDEsb3U9
RW50cnVzdCUyME5GSSUyMFRlc3QlMjBTaGFyZWQlMjBTZXJ2aWNlJTIwUHJvdmlkZXIsb3U9Q2Vy
dGlmaWNhdGlvbiUyMEF1dGhvcml0aWVzLG89RW50cnVzdCxjPVVTP2NlcnRpZmljYXRlUmV2b2Nh
dGlvbkxpc3Q7YmluYXJ5MIGRoIGOoIGLpIGIMIGFMQswCQYDVQQGEwJVUzEQMA4GA1UEChMHRW50
cnVzdDEiMCAGA1UECxMZQ2VydGlmaWNhdGlvbiBBdXRob3JpdGllczExMC8GA1UECxMoRW50cnVz
dCBORkkgVGVzdCBTaGFyZWQgU2VydmljZSBQcm92aWRlcjENMAsGA1UEAxMEQ1JMMzArBgNVHRAE
JDAigA8yMDE0MDkyOTIwMDM1MFqBDzIwMTUwMzI5MjAzMzUwWjAfBgNVHSMEGDAWgBTLcYutbAwe
zUeR5ydPGL78PE0YSTAdBgNVHQ4EFgQUcU6zmu8xjdZnKYrl4bfXuXT2tlkwCQYDVR0TBAIwADAZ
BgkqhkiG9n0HQQAEDDAKGwRWOC4xAwIDqDANBgkqhkiG9w0BAQsFAAOCAQEAGv87h5jWBdyEVWhE
flMhIhTVQhEFyXavvfdB/8wcNMoNlKKI8ZmcnSnSgq/cFliEdixerBf7bkmi/4UHrW/WFQjgUK7J
UijgUOFq4MC3hbDRK7tPhgonAMI1FVBLMxmCdZJxg5InGS6pILgTXHBWkGEKlLXTJ2qndhUKbJZB
kX7UsNFiaO59KDiJRUXdlMr4wtOZgImMxMD+Rm81l0tj0xraAKHS80EQ4mEDNJZ3MB1ZzMESA+K9
C/doJLNAtYBBhYXv02qYMZxBV0bqvu62cSRuBJVxM/8hSRlj1tTKUC3PTz2umCFQ8J2LUtF1BEg5
hyEE6TxbK9cCmx5HHt4kKQ==</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">bryantj@inhs.org</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer"/>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2014-11-10T21:18:13.506Z" NotOnOrAfter="2014-11-11T01:17:13.506Z">
          <saml2:AudienceRestriction>
            <saml2:Audience>http://ihe.connecthaton.XUA/X-ServiceProvider-IHE-Connectathon</saml2:Audience>
          </saml2:AudienceRestriction>
        </saml2:Conditions>
        <saml2:AuthnStatement AuthnInstant="2014-11-10T21:18:13.506Z" SessionIndex="123456">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:Password</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute FriendlyName="XSPA Subject" Name="urn:oasis:names:tc:xacml:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Bryant Jerimiah</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute FriendlyName="XSPA Organization" Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">INHS</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute FriendlyName="XSPA Organization ID" Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:anyURI">2.16.840.1.113883.3.607</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute FriendlyName="XCA Home Community ID" Name="urn:ihe:iti:xca:2010:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:anyURI">urn:oid:2.16.840.1.113883.3.607.1.990.2.1.1.21</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
            <saml2:AttributeValue>
              <Role code="112247003" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Medical Doctor" xmlns="urn:hl7-org:v3"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:1.0:resource:resource-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri"/>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
            <saml2:AttributeValue>
              <PurposeOfUse code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xmlns="urn:hl7-org:v3"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
    </wsse:Security>

  </env:Header>
  <env:Body>
    <xdsb:RetrieveDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007">
      <xdsb:DocumentRequest>
        <xdsb:HomeCommunityId>urn:oid:2.16.840.1.113883.3.42.10001.100001.19</xdsb:HomeCommunityId>
        <xdsb:RepositoryUniqueId>2.16.840.1.113883.3.333.1</xdsb:RepositoryUniqueId>
        <xdsb:DocumentUniqueId>4eb38f09-78da-43a8-a5b4-92b115c74add</xdsb:DocumentUniqueId>
      </xdsb:DocumentRequest>
    </xdsb:RetrieveDocumentSetRequest>
  </env:Body>
</env:Envelope>